In [48]:
import pandas as pd

In [118]:
df2 = pd.read_csv('data/bs140513_032310.csv')
''' 
# Drop columns:
zipcodeOri : Same for all
zipMerchant: Same for all
fraud: present in another dataframe
'''
df2=df2.drop(['zipcodeOri','zipMerchant'],axis=1)
df2.head(1)

,step,customer,age,gender,merchant,category,amount,fraud
0,0,'C1093826151','4','M','M348934600','es_transportation',4.55,0

In [119]:
# Remove quote marks from 3 columns
for columns in df2[['customer','age','gender','merchant','category']]:
    df2[columns]=df2[columns].str.replace('\'','')

In [120]:
df2.head(2)

   step     customer age gender    merchant           category  amount  fraud
0     0  C1093826151   4      M  M348934600  es_transportation    4.55      0
1     0   C352968107   2      M  M348934600  es_transportation   39.68      0

In [121]:
df2.to_csv('data/processed_final.csv',index=False)

In [110]:
df_new['amount'].equals(df_new['Weight'])

True